lessons/OrganicChemistry/05.org
#+TITLE: Organic Chemistry 05
#+AUTHOR: MKQ
#+KEYWORDS: note
#+LATEX_COMPILER: xelatex
#+LATEX_HEADER:\usepackage[scheme=plain]{ctex}
* 立体化学
** 异构体分类
\begin{cases}
\mbox{构造异构}

	\begin{cases}
	\mbox{碳架异构}	\\
	\mbox{官能团位置异构}	\\
	\mbox{官能团异构}	\\
	\mbox{互变异构}
    \end{cases}	\\
\mbox{立体异构}
	\begin{cases}
	\mbox{构型异构}
		\begin{cases}
		\mbox{顺反异构}	\\
            \mbox{光学异构}
		\end{cases}	\\
	\mbox{构像异构}
	\end{cases}
\end{cases}
** 构造异构
相同分子式但是原子排列不同
** 立体异构
相同分子式,相同原子连接方式,不同空间排列
** 手性,手性分子
实物和镜像不能重合
有手性的分子就是手性分子
- 如果实物可以和镜像重合就是同一种物质,是非手性的,无对映体
- 两个对映体物化性质相差很小,但是对平面偏振光作用不同,也叫作旋光异构
- 能使平面偏振光偏转:旋光性,光学活性
*** 外消旋体
等量旋光异构体混合在一起
\[
\%e.e=\frac{[R]-[S]}{[R]+[S]} =\%R -\%S
\]
- \%e.e就是对映体过量
*** 分子对称因素
- 对称面
- 对称中心
- 对称轴
- 四重反轴
只有对称轴的话是手性的
** 含有手性碳分子的立体化学
*** 一个手性碳
- 手性碳:和四个不同基团连接的碳
- 常用(*)标注
- 手性中心:集团围绕这一点不对称排列
- 手性碳和其他原子都可以是手性中心
*** 对映体
- 含有一个手性碳的分子是手性分子,有一对对映体
- 使平面偏振光左偏:左旋体(-)
- 反之右旋体(+)
- 二者旋光度相同,方向相反
*** Fischer投影式
*** D-L构型
- 羟基在右边:D
- 羟基在左边:L
- 醛基在上
*** R-S构型
*** 潜不对称碳原子
- 被一个集团取代后失去对称性
** 含有多个手性碳分子
*** 非对映体
不成镜像关系的旋光异构体
*** 赤/苏式
- 赤式:两个氢在同侧
- 苏式:两个氢在异侧
*** 差向异构体
只有一个手性碳构型不同
- 在端基时是端基差向异构体

*** 内消旋体
分子内部形成对映两半的化合物
有对称面
- 没有旋光性
*** 假不对称碳原子
一个碳原子A如果和两个相同的手性碳原子相连而且构型相同时,就是对称碳原子
否则是假不对称碳原子
- R>S
- 顺>反
- 用r/s表示
** 环状化合物的立体异构
必须用R/S
- 反-1,2-二甲基环己烷有手性
所以要写RS
- 通常用平面来考虑,和考虑立体构型一样的
** 其他光活性的分子
季铵盐
- 三级胺也是四面体,但变化太快,但硫磷就比较慢
- 可以用桥基固定
** 不含手性原子的光活性异构体
- 丙二烯型
- 螺环类似物
- 联苯
- 联萘
- 把手型
- 骈苯
** 化学性质


和旋光化合物反应时会有影响
(尤其是生物体内)
