lessons/OrganicChemistry/05.tex
% Created 2019-10-13 日 12:44
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[scheme=plain]{ctex}
\author{MKQ}
\date{\today}
\title{Organic Chemistry 05}
\hypersetup{
 pdfauthor={MKQ},
 pdftitle={Organic Chemistry 05},
 pdfkeywords={note},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{立体化学}
\label{sec:org6a3b5e4}
\subsection{异构体分类}
\label{sec:orga431b79}
\begin{cases}
\mbox{构造异构}

	\begin{cases}
	\mbox{碳架异构}	\\
	\mbox{官能团位置异构}	\\
	\mbox{官能团异构}	\\
	\mbox{互变异构}
    \end{cases}	\\
\mbox{立体异构}
	\begin{cases}
	\mbox{构型异构}
		\begin{cases}
		\mbox{顺反异构}	\\
            \mbox{光学异构}
		\end{cases}	\\
	\mbox{构像异构}
	\end{cases}
\end{cases}
\subsection{构造异构}
\label{sec:org12828f9}
相同分子式但是原子排列不同
\subsection{立体异构}
\label{sec:org2cd9ae9}
相同分子式,相同原子连接方式,不同空间排列
\subsection{手性,手性分子}
\label{sec:org1d22ba6}
实物和镜像不能重合
有手性的分子就是手性分子
\begin{itemize}
\item 如果实物可以和镜像重合就是同一种物质,是非手性的,无对映体
\item 两个对映体物化性质相差很小,但是对平面偏振光作用不同,也叫作旋光异构
\item 能使平面偏振光偏转:旋光性,光学活性
\end{itemize}
\subsubsection{外消旋体}
\label{sec:orga45b1d7}
等量旋光异构体混合在一起
\[
\%e.e=\frac{[R]-[S]}{[R]+[S]} =\%R -\%S
\]
\begin{itemize}
\item $\backslash$%e.e就是对映体过量
\end{itemize}
\subsubsection{分子对称因素}
\label{sec:org742169d}
\begin{itemize}
\item 对称面
\item 对称中心
\item 对称轴
\item 四重反轴
\end{itemize}
只有对称轴的话是手性的
\subsection{含有手性碳分子的立体化学}
\label{sec:org21f7cc5}
\subsubsection{一个手性碳}
\label{sec:orgf169cb4}
\begin{itemize}
\item 手性碳:和四个不同基团连接的碳
\item 常用(*)标注
\item 手性中心:集团围绕这一点不对称排列
\item 手性碳和其他原子都可以是手性中心
\end{itemize}
\subsubsection{对映体}
\label{sec:org56f5360}
\begin{itemize}
\item 含有一个手性碳的分子是手性分子,有一对对映体
\item 使平面偏振光左偏:左旋体(-)
\item 反之右旋体(+)
\item 二者旋光度相同,方向相反
\end{itemize}
\subsubsection{Fischer投影式}
\label{sec:org56e0918}
\subsubsection{D-L构型}
\label{sec:org0d770fa}
\begin{itemize}
\item 羟基在右边:D
\item 羟基在左边:L
\item 醛基在上
\end{itemize}
\subsubsection{R-S构型}
\label{sec:orga1be54f}
\subsubsection{潜不对称碳原子}
\label{sec:org69b363b}
\begin{itemize}
\item 被一个集团取代后失去对称性
\end{itemize}
\subsection{含有多个手性碳分子}
\label{sec:orgdaeb932}
\subsubsection{非对映体}
\label{sec:orgb1902bc}
不成镜像关系的旋光异构体
\subsubsection{赤/苏式}
\label{sec:org5fcf163}
\begin{itemize}
\item 赤式:两个氢在同侧
\item 苏式:两个氢在异侧
\end{itemize}
\subsubsection{差向异构体}
\label{sec:org3d294f8}
只有一个手性碳构型不同
\begin{itemize}
\item 在端基时是端基差向异构体
\end{itemize}

\subsubsection{内消旋体}
\label{sec:orged2eece}
分子内部形成对映两半的化合物
有对称面
\begin{itemize}
\item 没有旋光性
\end{itemize}
\subsubsection{假不对称碳原子}
\label{sec:orge03e3fa}
一个碳原子A如果和两个相同的手性碳原子相连而且构型相同时,就是对称碳原子
否则是假不对称碳原子
\begin{itemize}
\item R>S
\item 顺>反
\item 用r/s表示
\end{itemize}
\subsection{环状化合物的立体异构}
\label{sec:orgb0ec4ba}
必须用R/S
\begin{itemize}
\item 反-1,2-二甲基环己烷有手性
\end{itemize}
所以要写RS
\begin{itemize}
\item 通常用平面来考虑,和考虑立体构型一样的
\end{itemize}
\subsection{其他光活性的分子}
\label{sec:orgb08a30c}
季铵盐
\begin{itemize}
\item 三级胺也是四面体,但变化太快,但硫磷就比较慢
\item 可以用桥基固定
\end{itemize}
\subsection{不含手性原子的光活性异构体}
\label{sec:orgcce811c}
\begin{itemize}
\item 丙二烯型
\item 螺环类似物
\item 联苯
\item 联萘
\item 把手型
\item 骈苯
\end{itemize}
\subsection{化学性质}
\label{sec:orgcd1de3e}


和旋光化合物反应时会有影响
(尤其是生物体内)
\end{document}
